# 基本操作

In [11]:
import pandas as pd
df=pd.read_csv('../datasets/titanic.csv')

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [29]:
# 自己创建DataFrame结构
data={'country':['aa','bb','cc'],'population':[10,20,30]}
df_data=pd.DataFrame(data)
# df_data.info()
df_data

  country  population
0      aa          10
1      bb          20
2      cc          30

In [57]:
# 取指定的数据 series:dataframe
age=df['Age']
age[:5]
age.index
age.values[:5]

array([22., 38., 26., 35., 35.])

In [59]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
# 设置索引
# df = df.set_index('Name')

df.head(10)
df['Age'][:5]

Name
Braund, Mr. Owen Harris                                22.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    38.0
Heikkinen, Miss. Laina                                 26.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           35.0
Allen, Mr. William Henry                               35.0
Name: Age, dtype: float64

In [89]:
# 根据索引来查找对应的年龄
age = df['Age']
age['Heikkinen, Miss. Laina']

26.0

In [101]:
# 运算
age =age+10
age

Name
Braund, Mr. Owen Harris                                52.0
Cumings, Mrs. John Bradley (Florence Briggs Thayer)    68.0
Heikkinen, Miss. Laina                                 76.0
Futrelle, Mrs. Jacques Heath (Lily May Peel)           65.0
Allen, Mr. William Henry                               65.0
                                                       ...
Montvila, Rev. Juozas                                  57.0
Graham, Miss. Margaret Edith                           49.0
Johnston, Miss. Catherine Helen "Carrie"                NaN
Behr, Mr. Karl Howell                                  56.0
Dooley, Mr. Patrick                                    62.0
Name: Age, Length: 891, dtype: float64

In [107]:
age.min()
age.max()
age.mean()

59.72712885154061

In [111]:
# 可以得到数据的基本统计特性
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.727129,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.538632,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200